<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <title>studio2i</title>
        @vite('resources/sass/app.scss')
    </head>
    <body class="body">
        <header class="header">
            <div class="header__inner">
                <a href="#" class="header__logo logo" title="Home">
                    <img
                        src="{{ asset('images/icons/logo.svg') }}"
                        alt=""
                        class="logo__image"
                        width="64px"
                        height="64px"
                    />
                </a>

                <nav class="header__menu">
                    <ul class="header__menu-list">
                        <li class="header__menu-item">
                            <a href="#" class="header__menu-link">Услуги</a>
                        </li>
                        <li class="header__menu-item">
                            <a href="#" class="header__menu-link">Портфолио</a>
                        </li>
                        <li class="header__menu-item">
                            <a href="#" class="header__menu-link">Контакты</a>
                        </li>

                        <li class="header__menu-item">
                            <a
                                href="tel:+79310093772"
                                class="header__menu-link header__button button__transparent"
                            >
                                <svg
                                    width="10"
                                    height="16"
                                    viewBox="0 0 10 16"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M8.5 0H1.5C0.65625 0 0 0.6875 0 1.5V14.5C0 15.3438 0.65625 16 1.5 16H8.5C9.3125 16 10 15.3438 10 14.5V1.5C10 0.6875 9.3125 0 8.5 0ZM5 15C4.4375 15 4 14.5625 4 14C4 13.4688 4.4375 13 5 13C5.53125 13 6 13.4688 6 14C6 14.5625 5.53125 15 5 15ZM8.5 11.625C8.5 11.8438 8.3125 12 8.125 12H1.875C1.65625 12 1.5 11.8438 1.5 11.625V1.875C1.5 1.6875 1.65625 1.5 1.875 1.5H8.125C8.3125 1.5 8.5 1.6875 8.5 1.875V11.625Z"
                                        fill="#222222"
                                    />
                                </svg>
                                +7 931 009-37-72
                            </a>
                        </li>
                    </ul>
                </nav>
            </div>
        </header>

        <main class="main">
            <div class="main__inner">
                <div class="main__hero">
                    <h1 class="main__title">
                        Разработка веб-сервисов
                        <br />
                        и сайтов c 2013 года
                    </h1>

                    <a
                        href="tel:+79310093772"
                        class="main__button button__painted"
                    >
                        <svg
                            width="10"
                            height="16"
                            viewBox="0 0 10 16"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                        >
                            <path
                                d="M8.5 0H1.5C0.65625 0 0 0.6875 0 1.5V14.5C0 15.3438 0.65625 16 1.5 16H8.5C9.3125 16 10 15.3438 10 14.5V1.5C10 0.6875 9.3125 0 8.5 0ZM5 15C4.4375 15 4 14.5625 4 14C4 13.4688 4.4375 13 5 13C5.53125 13 6 13.4688 6 14C6 14.5625 5.53125 15 5 15ZM8.5 11.625C8.5 11.8438 8.3125 12 8.125 12H1.875C1.65625 12 1.5 11.8438 1.5 11.625V1.875C1.5 1.6875 1.65625 1.5 1.875 1.5H8.125C8.3125 1.5 8.5 1.6875 8.5 1.875V11.625Z"
                                fill="#222222"
                            />
                        </svg>
                        +7 931 009-37-72
                    </a>
                </div>
            </div>
        </main>

        <footer class="footer">
            <div class="footer__top">
                <div class="footer__contacts footer__sales">
                    <h6 class="footer__title">Отдел продаж</h6>
                    <a href="tel:+79310093772" class="footer__number">
                        +7 931 009-37-72
                    </a>
                    <div class="social">
                        <a href="#" class="telegram network__container">
                            <span class="network__container-inside">
                                <svg
                                    width="16"
                                    height="14"
                                    viewBox="0 0 16 14"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M15.9541 1.21692C16.1686 0.216195 15.5967 -0.176947 14.9534 0.0732344L0.728822 5.54148C-0.236162 5.93462 -0.200422 6.47072 0.585862 6.7209L4.19562 7.82885L12.6303 2.53931C13.0234 2.25338 13.4166 2.43209 13.0949 2.68227L6.26855 8.82957L6.01837 12.5823C6.41151 12.5823 6.55447 12.4393 6.76891 12.2249L8.52018 10.5094L12.2014 13.2256C12.8805 13.6188 13.3808 13.4043 13.5595 12.618L15.9541 1.21692Z"
                                        fill="white"
                                    />
                                </svg>

                                <span class="social__text">Telegram</span>
                            </span>
                        </a>
                        <a href="#" class="whatsapp network__container">
                            <span class="network__container-inside">
                                <svg
                                    width="16"
                                    height="16"
                                    viewBox="0 0 16 16"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fill-rule="evenodd"
                                        clip-rule="evenodd"
                                        d="M13.5714 2.35714C12.1071 0.857143 10.1071 0 7.96429 0C3.60714 0 0.0357143 3.57143 0.0357143 7.92857C0.0357143 9.35714 0.428571 10.7143 1.10714 11.8929L0 16L4.17857 14.9286C5.35714 15.5357 6.64286 15.8929 7.96429 15.8929C12.3571 15.8929 16 12.3214 16 7.96429C16 5.82143 15.0714 3.85714 13.5714 2.35714ZM10.25 8.96429C10.4286 9.03571 11.3929 9.5 11.6071 9.60714C11.66 9.63888 11.7098 9.66435 11.7546 9.68727C11.861 9.74171 11.9392 9.78174 11.9643 9.85714C12.0357 9.92857 12.0357 10.3214 11.8571 10.7857C11.6786 11.25 10.8929 11.6786 10.5357 11.7143C9.89286 11.8214 9.39286 11.7857 8.14286 11.2143C6.39269 10.4642 5.1895 8.83897 4.84442 8.37284C4.79516 8.3063 4.76338 8.26338 4.75 8.25C4.64286 8.10714 3.96429 7.17857 3.96429 6.17857C3.96429 5.30832 4.37153 4.8453 4.58221 4.60577C4.60497 4.57988 4.62544 4.55661 4.64286 4.53571C4.82143 4.32143 5.03571 4.28571 5.17857 4.28571H5.53571C5.54669 4.28571 5.55766 4.2855 5.56865 4.28529C5.70073 4.28276 5.83514 4.28018 6 4.64286C6.08745 4.88335 6.28197 5.33798 6.4279 5.67903C6.52035 5.8951 6.59329 6.06559 6.60714 6.10714C6.64286 6.21429 6.67857 6.32143 6.60714 6.46429C6.44623 6.80221 6.27081 6.98063 6.14622 7.10734C5.99431 7.26186 5.91798 7.33949 6.03571 7.53571C6.82143 8.85714 7.57143 9.32143 8.75 9.89286C8.92857 10 9.03571 9.96429 9.17857 9.85714C9.21298 9.81126 9.27686 9.73224 9.35127 9.64017C9.50858 9.44555 9.71298 9.19265 9.78571 9.07143C9.92857 8.85714 10.0714 8.89286 10.25 8.96429Z"
                                        fill="white"
                                    />
                                </svg>
                                <span class="social__text">Whatsapp</span>
                            </span>
                        </a>
                    </div>
                </div>

                <div class="footer__contacts footer__service">
                    <h6 class="footer__title">Сервисный отдел</h6>
                    <a href="tel:+79310093774" class="footer__number">
                        +7 931 009-37-74
                    </a>
                    <div class="social">
                        <a href="#" class="telegram network__container">
                            <span class="network__container-inside">
                                <svg
                                    class="image"
                                    width="16"
                                    height="14"
                                    viewBox="0 0 16 14"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        d="M15.9541 1.21692C16.1686 0.216195 15.5967 -0.176947 14.9534 0.0732344L0.728822 5.54148C-0.236162 5.93462 -0.200422 6.47072 0.585862 6.7209L4.19562 7.82885L12.6303 2.53931C13.0234 2.25338 13.4166 2.43209 13.0949 2.68227L6.26855 8.82957L6.01837 12.5823C6.41151 12.5823 6.55447 12.4393 6.76891 12.2249L8.52018 10.5094L12.2014 13.2256C12.8805 13.6188 13.3808 13.4043 13.5595 12.618L15.9541 1.21692Z"
                                        fill="white"
                                    />
                                </svg>

                                <span class="social__text">Telegram</span>
                            </span>
                        </a>
                        <a href="#" class="whatsapp network__container">
                            <span class="network__container-inside">
                                <svg
                                    class="image"
                                    width="16"
                                    height="16"
                                    viewBox="0 0 16 16"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fill-rule="evenodd"
                                        clip-rule="evenodd"
                                        d="M13.5714 2.35714C12.1071 0.857143 10.1071 0 7.96429 0C3.60714 0 0.0357143 3.57143 0.0357143 7.92857C0.0357143 9.35714 0.428571 10.7143 1.10714 11.8929L0 16L4.17857 14.9286C5.35714 15.5357 6.64286 15.8929 7.96429 15.8929C12.3571 15.8929 16 12.3214 16 7.96429C16 5.82143 15.0714 3.85714 13.5714 2.35714ZM10.25 8.96429C10.4286 9.03571 11.3929 9.5 11.6071 9.60714C11.66 9.63888 11.7098 9.66435 11.7546 9.68727C11.861 9.74171 11.9392 9.78174 11.9643 9.85714C12.0357 9.92857 12.0357 10.3214 11.8571 10.7857C11.6786 11.25 10.8929 11.6786 10.5357 11.7143C9.89286 11.8214 9.39286 11.7857 8.14286 11.2143C6.39269 10.4642 5.1895 8.83897 4.84442 8.37284C4.79516 8.3063 4.76338 8.26338 4.75 8.25C4.64286 8.10714 3.96429 7.17857 3.96429 6.17857C3.96429 5.30832 4.37153 4.8453 4.58221 4.60577C4.60497 4.57988 4.62544 4.55661 4.64286 4.53571C4.82143 4.32143 5.03571 4.28571 5.17857 4.28571H5.53571C5.54669 4.28571 5.55766 4.2855 5.56865 4.28529C5.70073 4.28276 5.83514 4.28018 6 4.64286C6.08745 4.88335 6.28197 5.33798 6.4279 5.67903C6.52035 5.8951 6.59329 6.06559 6.60714 6.10714C6.64286 6.21429 6.67857 6.32143 6.60714 6.46429C6.44623 6.80221 6.27081 6.98063 6.14622 7.10734C5.99431 7.26186 5.91798 7.33949 6.03571 7.53571C6.82143 8.85714 7.57143 9.32143 8.75 9.89286C8.92857 10 9.03571 9.96429 9.17857 9.85714C9.21298 9.81126 9.27686 9.73224 9.35127 9.64017C9.50858 9.44555 9.71298 9.19265 9.78571 9.07143C9.92857 8.85714 10.0714 8.89286 10.25 8.96429Z"
                                        fill="white"
                                    />
                                </svg>
                                <span class="social__text">Whatsapp</span>
                            </span>
                        </a>
                    </div>
                </div>

                <div class="footer__contacts footer__work">
                    <a href="mailto: mail@studio2i.ru">
                        <p class="footer__mail">mail@studio2i.ru</p>
                    </a>
                    <p class="footer__time">
                        По будням с 10:00 до 19:00 (по Москве)
                    </p>
                </div>
            </div>
        </footer>

        <section class="footer__bottom">
            <p class="footer__bottom-rights">
                © 2013-2025 Диджитал-агентство 2И
            </p>
            <p class="footer__bottom-name">
                ИП Артамонов Иван Сергеевич
                <br />
                ОГРНИП 316470400116880
            </p>
        </section>
    </body>
</html>
